Repository: RenzWay/typescript-webpack
Catalog: xliff/*.xlf
Languages: id

# sd52a980b39194bb9
source: ⚙️ Development & Production Modes
id: ⚙️ Mode Development & Production

# s13b417677a49963f
source: ⌨️ Typescript language
id: ⌨️ Bahasa Typescript

# s5f659885503d4192
source: 🎨 CSS asset loader support
id: 🎨 Dukungan CSS asset loader

# se4d6377c76a28ae3
source: 📄 Auto HTML via HtmlWebpackPlugin
id: 📄 HTML Otomatis via HtmlWebpackPlugin

# s9ced5a7285498e70
source: Clone the repo: git clone https://github.com/RenzWay/typescript-webpack.git
id: Clone repositori: git clone https://github.com/RenzWay/typescript-webpack.git

# sd5d2cefba07df76b
source: Remove Remote: git remote remove origin
id: Hapus Remote: git remote remove origin

# s01ada767179d5de4
source: Start dev server: npm run dev
id: Jalankan dev server: npm run dev

# s3cbdfddb2e50e923
source: Edit code in src/ & see it live!
id: Edit kode di src/ & lihat langsung hasilnya!

# sb6447615b38d31c2
source: Create pages inside the pages folder.
id: Buat halaman di dalam folder pages.

# sfe4170b8c36ff3cf
source: Import those pages into router.js.
id: Import halaman tersebut ke router.js.

# sc7cf5d8dc79d3c60
source: Use URL hash (e.g., #/) to navigate between pages.
id: Gunakan URL hash (contoh: #/) untuk navigasi antar halaman.

# sef04f9c2dbcf609f
source: Try switching pages without full reload!
id: Coba pindah halaman tanpa reload penuh!

# s4bbae9269139d054
source: Don't worry — using ( #/ ) won't cause any errors.
id: Jangan khawatir — menggunakan ( #/ ) tidak akan menyebabkan error.

# se0f98e9b3037b56c
source: A simple starter for Typescript with Webpack
id: Starter sederhana untuk Typescript dengan Webpack

# sa9118b036e508a0b
source: Visit Github
id: Kunjungi Github

# s4f2980ecb792cb50
source: What's Included?
id: Apa Saja yang Disertakan?

# s2eb45e1ae02bfa0a
source: How to use?
id: Bagaimana cara menggunakan?

# s1f22ae160e2aca9a
source: Routing Usage
id: Penggunaan Routing
